Revit 2027 API
SaveOptions Properties
The SaveOptions type exposes the following members.
Properties
Name | Description
Compact |  Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PreviewViewId |  The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Top
See Also
Reference
SaveOptions Class
Autodesk.Revit.DB Namespace